W4D1/app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    book = Book.find_by(id: params[:id])

INSERT INTO "books" ("title", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Harry Potter"], ["author", "Jk"], ["created_at", "2018-05-07 19:57:26.153715"], ["updated_at", "2018-05-07 19:57:26.153715"]]
---
  def create
    book = Book.new(book_params)

    if book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 1]]
---
  def destroy
    book = Book.find(params[:id])

    if book.destroy